package com.nick.nicknamecreator.service;

public class MyData {
    public final int[] CHO_FIRST = {756, 164, 674, 693, 38, 1782, 699, 749, 6, 1127, 31, 1606, 630, 76, 151, 126, 157, 220, 315};
    public final int[] JUN_FIRST = {2695, 598, 69, 1, 592, 422, 170, 19, 1064, 13, 0, 50, 19, 957, 13, 6, 88, 50, 737, 57, 2380};
    public final int[] JON_FIRST = {6618, 183, 0, 6, 686, 0, 0, 6, 945, 0, 0, 0, 0, 0, 0, 0, 642, 88, 13, 202, 0, 535, 19, 38, 0, 13, 6, 0};
    public final int[] CHO_LAST = {713, 139, 713, 652, 35, 2174, 678, 878, 2, 1026, 26, 1452, 539, 61, 165, 78, 191, 243, 235};
    public final int[] JUN_LAST = {2617, 583, 61, 0, 609, 417, 165, 9, 783, 9, 0, 35, 26, 974, 17, 9, 96, 70, 704, 35, 2781};
    public final int[] JON_LAST = {6722, 174, 0, 9, 574, 0, 0, 9, 939, 0, 0, 0, 0, 0, 0, 0, 730, 87, 17, 139, 0, 530, 9, 35, 0, 17, 9, 0};
    public final int[] CHO = {833, 93, 648, 833, 0, 2407, 278, 556, 0, 1389, 93, 1111, 1296, 0, 185, 93, 93, 93, 0};
    public final int[] JUN = {2130, 463, 185, 0, 370, 648, 0, 0, 1204, 0, 0, 93, 0, 1019, 0, 0, 0, 0, 1204, 185, 2500};
    public final int[] JON = {6667, 278, 0, 0, 741, 0, 0, 0, 1019, 0, 0, 0, 0, 0, 0, 0, 648, 0, 0, 278, 0, 370, 0, 0, 0, 0, 0, 0};


    public final char[] KOR_ONE_TEXT = {'리', '가', '지', '다', '마', '바', '래', '라', '랑', '사', '드', '구', '돌', '부', '나', '소', '우'};
    public final int[] KOR_ONE_CNT = {890, 685, 548, 411, 479, 1712, 411, 548, 411, 616, 479, 411, 479, 411, 616, 479, 411};
    public final char[] KOR_ONE_FIRST_TEXT = {'하', '소', '라', '리', '도', '무', '지', '르', '미', '그', '자', '기', '드', '래', '다', '수', '주', '사', '새', '랑', '나', '루', '시', '비', '온', '마', '바', '우', '모', '이', '람', '가', '아', '구', '돌', '물', '니', '치'};
    public final int[] KOR_ONE_FIRST_CNT = {210, 225, 258, 1179, 210, 194, 420, 129, 307, 178, 145, 323, 162, 194, 210, 242, 129, 258, 194, 145, 258, 129, 210, 307, 129, 339, 436, 210, 129, 501, 468, 323, 371, 162, 145, 129, 307, 129};
    public final char[] KOR_ONE_LAST_TEXT={'이', '리', '마', '기', '미', '람', '비', '지', '니'};
    public final int[] KOR_ONE_LAST_CNT={1436, 3076, 410, 974, 615, 1333, 667, 615, 872};

    public final char[] ONE_TEXT = {'루', '라', '미', '시', '우', '새', '비', '수', '니', '자', '레', '래', '린', '소', '노', '로', '나', '리', '가', '하', '바', '오', '사', '아', '그', '기', '무', '다', '드', '스', '도', '이', '람', '지', '구', '마'};
    public final int[] ONE_CNT = {13, 31, 22, 15, 13, 13, 24, 15, 20, 10, 15, 12, 10, 16, 11, 14, 24, 103, 20, 13, 31, 10, 18, 49, 14, 20, 12, 14, 13, 13, 14, 47, 29, 26, 10, 25};

    public final char[] FOR_ONE_FIRST_TEXT = {'로', '오', '디', '루', '마', '리', '알', '일', '제', '엘', '드', '안', '이', '미', '아', '브', '노', '그', '레', '에', '클', '든', '비', '어', '벨', '린', '나', '바', '라', '슨', '카', '올', '스'};
    public final int[] FOR_ONE_FIRST_CNT = {312, 312, 179, 223, 179, 1339, 134, 312, 134, 268, 134, 134, 714, 134, 1161, 179, 223, 134, 357, 223, 134, 134, 223, 223, 179, 179, 357, 179, 670, 179, 134, 179, 446};
    public final char[] FOR_ONE_TEXT = {'로', '오', '디', '루', '마', '리', '알', '일', '제', '엘', '드', '안', '이', '미', '아', '그', '레', '에', '비', '어', '벨', '린', '나', '라', '카', '올', '스'};
    public final int[] FOR_ONE_CNT = {312, 312, 179, 223, 179, 1339, 134, 312, 34, 268, 134, 134, 714, 234, 1161, 134, 357, 223, 223, 223, 179, 179, 357, 670, 134, 179, 446};
    public final char[] FOR_ONE_LAST_TEXT = {'이', '리', '바', '디', '로', '나', '스', '든', '슨', '어', '라', '아', '린'};
    public final int[] FOR_ONE_LAST_CNT ={405, 1486, 405, 405, 405, 811, 675, 405, 541, 541, 1622, 1892, 405};

    public final String[] KOR_TWO = {"미르","푸르","미리","리내","온새","미로","한울","아라","마루","가람","가온","가온","누리","가시","버시",
            "나리","솔길","윤슬","비늘","해리","헤윰","나린","아리","리아","피아","푸실","단미","아토","타니","까미","람이","희나","라온","하제","힐조","다미","미로","에멜",
            "지로","꽃잠","사나","나래","르샤","나르","베리","벼리","흐노","노니","노고","고지","지리","아미","이든","이내","너울","너비","누리","누리","아사","하제","아스",
            "라이","슈룹","가라","사니","라사","초아","나린","호드","두리","바람","까부","누리","까비","매지","리내","모라","라기","삿갓","달비","리나","비나","그린","나래",
            "하나","하야","로비","꼬리","별찌","그루","바오","살비","다흰","다원","가람","가비","파니","퍼르","해랑","타래","서리","도담","올리","사랑","리사","도래","래솔",
            "한울","여우","우비","하람","가론","조이","아름","드리","수리","우리","다라","아띠","새라","다솜","소니","다소","소니","난이","늦마","바리","마소","두래","산돌",
            "우물","여우","매지","구름","아람","느루","꼬지","르로","로이","바래","라지","그미","즈믄","마닐","다라","하슬","아라","가야","아리","리수","꽃샘","바람","소소",
            "소리","바람","돌개","바람","산돌","시랑","랑이","앙짜","옴니","암니","모꼬","나비","알이","머리","하늬","바람","북새","바람","마파","파람","파랑","자귀","다님",
            "소마","고수","머리","하마","움길","희치","소마","사달","사그","랑이","자리","바라","라기","지망","드레","모람","둔치","가라","라사","사니","무리","바치","거레",
            "수련","곰비","임비","구듭","구유","도리","그루","금새","기를","길마","길미","깜부","꾀로","꽃샘","꿰미","끄나","나래","남새","남우","내남","너널","더리","가리",
            "노루","노적","가리","놀금","높새","비음","눈미","느루","는개","다따","다랑","달랑","달포","도리","두리","바람","껑이","펄이","두리","저리","거리","린결","도사",
            "도섭","파니","동그","마니","아리","동티","되모","모시","두멍","뒤란","뒤웅","드난","드레","들마","들메","들피","쟁이","마고","코지","매개","드리","메지","부리",
            "가비","모래","모르","모주","구리","몽니","몽짜","꾸리","녀리","서리","텅이","미립","민패","절미","반기","방자","방짜","배내","버금","벼리","보드","북새","비나",
            "나리","비말","물이","지시","뿌다","구니","시랑","랑이","산돌","소매","사미","삼태","새경","새물","물내","새룽","바람","선술","소댕","소두","소래","소리","바람",
            "대기","사래","수지","지니","수채","스스","시게","시나","브로","시래","시세","시앗","랑이","실터","마니","니리","아람","아름","드리","아주","버니","안날","알섬",
            "알심","머리","라지","부루","너리","여남","남은","여리","여우","우비","여줄","가리","영판","옥셈","올무","아리","마니","수리","웃비","의초","리끼","도리","수리",
            "가리","여우","주니","돌이","진솔","짐짓","짜발","량이","짜장","마리","정이","찌그","트레","바리","푸네","풀무","하냥","하늬","하릅","사리","한무","한풀","구리",
    };
    public final String[] A = {"불","INTJ","현명한","바라보는","종종","오","열정적인","끈기있는","ISFJ","하이","이상한","유용한","깔끔한","날개달린","깨끗한","ISTJ","까리한",
            "회색","녹슨","빨강","미약한","ESFP","강철","격렬한","그냥","열심히 일하는","방구석","존경스러운","활기찬","응","얼음","ENFJ","일반적으로","흥많은","빛이나는",
            "그게","신선한","짱짱","통계적으로","이성적인","신비로운","너무","겨울날의","친절한","빛바랜","자신있는","기묘한","어쩔","스마트한","보들보들","요상한","ENTJ",
            "고물","완전","머리좋은","반가워","INTP","INFJ","저쩔","잔머리쓰는","재밌는","직관적인","ISTP","ESTP","파랑","화기애애한","민트","종이","경쾌한","진짜","섹시",
            "정확한","반짝반짝","검정","무쇠","바람","ESTJ","소곤소곤","핸섬","보라","수다스러운","야매","어떻게","까끌까끌","유머러스한","그건","가을날의","강한","밝은","잘생긴",
            "언젠간","큐티","외향적인","명백히","ENTP","귀여운","매력덩어리","역동적인","다이아","마성의","대담한","아주","아마도","치명적인","예쁜","몽실몽실","탐험하는","도전하는",
            "조금은","말많은","속삭이는","무조건","강력한","말랑말랑","꾸준한","사랑스러운","똑똑한","화난","ENFP","시한폭탄","고요한","빤짝빤짝","뿔달린","미세한","ISFP","순박한","바이바이",
            "투명한","급발진하는","크리티컬","작은","스르르","귀염둥이","긴","행복한","상냥한","우아한","잘가","초록","내향적인","짧은","핑크","약간","평화로운","귀요미","아름다운","왁자지껄",
            "맞음","높은","아니","투명","매끈한","정말","조용한","의문스러운","멀리","하양","봄날의","프리티","여름날의","창가의","시끄러운","미소 짓는","조심조심","분명히","어두운","곧","왜",
            "주황","창의적인","아낌없이","빛나는","노랑","네이비","흐르는","착한","화려한","솜","포근한","돌","짱센","ESFJ","물","큰","부들부들","깜깜한","신묘한","안녕","완벽한","INFP",
            "매력적인","감성적인","간지나는","맑은","흥겨운", "낭낭한", "낭랑한", "명랑한", "깐깐한", "밍밍한", "섬섬한", "듬쑥한", "미쁜", "보드라운", "천사", "악마", "요정", "포슬포슬한",
            "짱짱", "최고", "우주최강", "최강", "차가운", "북부", "남부", "서부", "동부","불같은","악당","영웅"};
    public final String[] B = {"입문자","봄","천재","빵","여름","구덩이","뚜벅이","박새","버스기사","고인물","개","장인","선크림","마에스트로","마니아","사마귀","돌고래","벚꽃",
            "잔디","멍멍이","악어","라임","시인","드래곤","팬더","독수리","짐","강","우산","말","날다람쥐","장미","거북","혜성","고슴도치","고릴라","오렌지","헬멧","솔로",
            "오소리","핸드백","시민","왕자","먹","봉황","바퀴","교사","여우","부채","공기","바보","유니콘","불닭","냥냥이","어른이","책","보드","인형","지갑","걸","함박눈",
            "스키","스파이","코끼리","두더지","데이터","귤","운석","파리","거미줄","성인","원숭이","무당벌레","흰수염고래","하늘다람쥐","닭","앵무새","태블릿","샤프","연필",
            "과학","박사","피자","별님","학생","은하수","지렁이","뉴비","먼지","보틀","구렁이","단풍","스마트폰","짱","꽃","샌드위치","물소","오목눈이","팽귄","청설모","마스터",
            "워리어","범고래","별","메이커","곰","메뚜기","아나콘다","자동차","프로그램","머그잔","모기","다리","영어","과자","고래","노트북","페가수스","국어","보이","코알라",
            "공주","사슴","소","히어로","파랑새","고등어","카멜레온","겨울","생물","다람쥐","햇살","꿈","펭귄","토끼","블랙홀","회오리","선인장","송아지","기린","뱀","스피커",
            "개구리","시계","테이블","치타","선풍기","칼바람","주먹","냉장고","감독","자전거","공작","알고리즘","오리","샛별","늑대","암탉","호랑이","펜","담당","왕","수탉","어린이",
            "카메라","샌드백","강아지","수정","사자","치킨","낙엽","사탕","보스","곰팡이","야옹이","물리","기차","볼펜","개나리","나방","도깨비","거북이","고양이","미적분","염소","책가방",
            "돼지","진눈깨비","표범","스니커즈","신발","목련","여왕","붓","눈","불사조","가을","수학","전문가","파일","안경","용","족발","마법사","닉네임","별똥별","평균","사람","택시",
            "바다","나비","김밥","썩은물","황제","이어폰","화학","거미","립스틱","킥보드","햄스터","호수","버스","병아리","캥거루","직박구리","마우스","왕도마뱀","초콜릿","피닉스","선생님",
            "세포","초보자", "대공", "황제", "황태자", "공작", "아가씨", "환생자", "빙의자", "주인공", "친구1"};
}
